In [1]:
import numpy as np
import pandas as pd

In [2]:
row=["row1", "row2", "row3", "row4"]
col=["col1", "col2", "col3", "col4"]
arr = np.arange(1, 17).reshape(4, 4)
df = pd.DataFrame(arr, index=[row])
df=df.rename(columns=[col])
df

TypeError: 'list' object is not callable

In [ ]:
arr = np.arange(1, 17).reshape(4, 4)
row = [f'row{i+1}' for i in range(4)]
col = [f'col{i+1}' for i in range(4)]
df = pd.DataFrame(arr, index=row, columns=col)
df['c5'] = [17,18,19,20]

In [ ]:
row=["row4", "row5", "row6", "row7"]
col=["col1", "col2", "col3", "col4"]
arr = np.arange(1, 17).reshape(4, 4)
df = pd.DataFrame(arr, index=[row])
df.columns=col
df

In [ ]:
df1=df.drop(["row4","row7"],axis=0)
df1

In [ ]:
df1.loc["row5", "col2"] = np.nan
df1.loc["row6", "col3"] = np.zeros
df1

In [ ]:
df=pd.DataFrame({"A":[10,20,30],
                 "B":[1,2,3],
                 "C":[11,22,33]}, index=["x","y","z"]
                )
df

In [ ]:
print(df.loc["y",:])
print(df.loc[:,"A"])

In [ ]:
print(df.loc["y","A"])

In [ ]:
print(df.loc["y":"z","A":"B"])

In [ ]:
print(df.iloc[1,:])

In [ ]:
print(df.head(2))
print(df.tail(2))

In [ ]:
print(df.loc["y","A"])
print(df["A"]["y"])#column name hen index
print(df.A.y)

In [ ]:
print(df.at["y","A"])#index(row) then column name
print(df.iat[1,0])

In [3]:
df=pd.DataFrame({"Amit":[10,20,30],
                 "Barsa":[40,50,60],
                 "Chinmay":[70,45,90]}, index=["x","y","z"]
                )
df

   Amit  Barsa  Chinmay
x    10     40       70
y    20     50       45
z    30     60       90

In [4]:
#display pass student marks>30
print("pass student marks>30")
print(df[df>=30])

pass student marks>30
   Amit  Barsa  Chinmay
x   NaN     40       70
y   NaN     50       45
z  30.0     60       90

In [5]:
#display pass student marks>30
print("pass student marks>30 and 70")
print(df[(df>=30) & (df<=70)])

pass student marks>30 and 70
   Amit  Barsa  Chinmay
x   NaN     40     70.0
y   NaN     50     45.0
z  30.0     60      NaN

In [6]:
print("transpose \n",df.T)

transpose
           x   y   z
Amit     10  20  30
Barsa    40  50  60
Chinmay  70  45  90

In [7]:
df=pd.DataFrame({"A":[10,20,30],
                 "B":[21,25,93],
                 "C":[11,2,3]}, index=["x","y","z"]
                )
df

    A   B   C
x  10  21  11
y  20  25   2
z  30  93   3

In [8]:
print(df.sort_index(axis=0))#sort by row index (descending)

    A   B   C
x  10  21  11
y  20  25   2
z  30  93   3

In [9]:
print(df.sort_index(axis=1, ascending=False))#sort by column index (decending)

    C   B   A
x  11  21  10
y   2  25  20
z   3  93  30

In [10]:
df=pd.DataFrame({"A":[1,30,-5],
                 "B":[2,20,-10],
                 "C":[3,10,5]}, index=["x","y","z"]
                )
df

    A   B   C
x   1   2   3
y  30  20  10
z  -5 -10   5

In [11]:
print(df.sort_index(axis=0))#sort by row index (descending)

    A   B   C
x   1   2   3
y  30  20  10
z  -5 -10   5

In [12]:
print(df.sort_index(axis=1, ascending=False))#sort by column index (descending)

    C   B   A
x   3   2   1
y  10  20  30
z   5 -10  -5

In [13]:
print(df.sort_values(by="A", axis=0))

    A   B   C
z  -5 -10   5
x   1   2   3
y  30  20  10

In [14]:
print(df.sort_values(by="x", axis=1, ascending=False))

    C   B   A
x   3   2   1
y  10  20  30
z   5 -10  -5

In [15]:
data={"Name ":["Anurag","Somen","Abijit","Avinash"],
         "Age ":[19,21,29,20],
         "Salary ":[85,90,20,100]}
df=pd.DataFrame(data)
print(df)
df.to_csv('SalarySlip.csv',index=False)
print("CSV FILE CREATED")

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100
CSV FILE CREATED

In [16]:
df2=pd.read_csv("SalarySlip.csv")
df2

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100

In [17]:
df3=pd.read_csv("/home/iteradmin/Desktop/2341019505/ML/SalarySlip.csv")
df3

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100

In [18]:
df2.describe()

            Age      Salary
count   4.000000    4.000000
mean   22.250000   73.750000
std     4.573474   36.371921
min    19.000000   20.000000
25%    19.750000   68.750000
50%    20.500000   87.500000
75%    23.000000   92.500000
max    29.000000  100.000000

In [19]:
df2["Name "].describe()

count          4
unique         4
top       Anurag
freq           1
Name: Name , dtype: object

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Age      4 non-null      int64
 2   Salary   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [21]:
data={"Name ":["Anurag","Somen","Abijit","Avinash"],
         "Age ":[19,21,29,20],
         "Salary ":[85,90,20,100]}
df=pd.DataFrame(data)
print("original dataframe\n",df)
print(df.duplicated())

original dataframe
      Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100
0    False
1    False
2    False
3    False
dtype: bool

In [22]:
df1=df.drop_duplicates()
df1

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100

In [23]:
df2=df.drop_duplicates(keep='last')
df2

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100

In [24]:
print("count dup:",df.duplicated().sum())

count dup: 0

In [25]:
print(df.isna())
print("cdk",df.isna())

   Name    Age   Salary
0  False  False    False
1  False  False    False
2  False  False    False
3  False  False    False
cdk    Name    Age   Salary
0  False  False    False
1  False  False    False
2  False  False    False
3  False  False    False

In [26]:
print(df.dropna())

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100

In [27]:
df.dropna(how='all')

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100

In [28]:
print(df.dropna(subset=['Age ','Salary ']))

     Name   Age   Salary
0   Anurag    19       85
1    Somen    21       90
2   Abijit    29       20
3  Avinash    20      100